# Dataframe Basics

Dataframe is most commonly used object in pandas. It is a table like datastructure containing rows and columns similar to excel spreadsheet


- Creating Pandas DataFrames from Lists and Dictionaries 
    - `from_dict`, `from_records`, `from_items`
- Basics Dataframe Operations
    - `df.shap, df.head(), df.tail(), df.columns, df.dtypes, df.describe()` 
- Querying the Dataframe
- Selecting / Dropping Columns
    - `df.drop(label, axix=0,1)`
- Duplicates
    - `df.duplicated(['event'])`
- String Operations on whole columns
- Column Transformations / Splits
    - `df.dtypes`, `df['column'].astype(np.int32)`
- Missing Values
    - `df.isnull()`
- `DataFrame.loc` vs. `DataFrame.iloc` vs. `DataFrame.at`
- MultiIndexing
- Joins
- Sorting
- Grouping - Aggregation & Value Counts
- Resetting Index
- Pivoting & Melting
- Column / Row Concatenation
- Looping through DataFrame

In [160]:
import pandas as pd
import numpy as np

## Creating Pandas DataFrames from Lists and Dictionaries

In [148]:
prices = [ [34,45,54],[45,43,98]]
df = pd.DataFrame(prices, columns = ['Jan', 'Feb', 'Mar'])
df

   Jan  Feb  Mar
0   34   45   54
1   45   43   98

In [149]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

![pandas-dataframe-shadow.png](pandas-dataframe-shadow.png)

## Basics Dataframe Operations

In [111]:
df.shape

(6, 4)

In [112]:
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [113]:
df.tail(5)

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [114]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [115]:
df.dtypes # Object Type of each column

day            object
temperature     int64
windspeed       int64
event          object
dtype: object

In [117]:
df.describe()            # df.describe(include='all'), df.describe(include=['O']), df.describe(include=['int64'])

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

## Querying the Dataframe

In [118]:
df['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [119]:
df['temperature'].sum()

182

In [120]:
df['temperature'].mean()

30.333333333333332

In [122]:
df[df.temperature > 30].head(5)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [123]:
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [124]:
df[df['event'].isin(['Rain', 'Snow' ])]

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

## Selecting / Dropping Columns

In [152]:
df['New Artist'] = df['event']
df

        day  temperature  windspeed  event New Artist
0  1/1/2017           32          6   Rain       Rain
1  1/2/2017           35          7  Sunny      Sunny
2  1/3/2017           28          2   Snow       Snow
3  1/4/2017           24          7   Snow       Snow
4  1/5/2017           32          4   Rain       Rain
5  1/6/2017           31          2  Sunny      Sunny

In [151]:
df.drop(['event'], axis=1,)   # data frame (axis 0=rows, 1=columns), drop from column with label New Artist

# df.drop(['New Artist'], axis=1, inplace=True)

        day  temperature  windspeed
0  1/1/2017           32          6
1  1/2/2017           35          7
2  1/3/2017           28          2
3  1/4/2017           24          7
4  1/5/2017           32          4
5  1/6/2017           31          2

## Duplicates

In [154]:
df.duplicated(['event']).sum()                                                    # Checking for duplicates in a specefic column

3

In [155]:
"""
df.drop_duplicates(['event'], keep='first').shape # Default is keep=first
df.drop_duplicates(['event'], keep='last').shape #keep=last keeps the last instance and deletes the rest
df.drop_duplicates(['event'], keep=False).shape # this deletes all the occurances of the duplicates so none is left.
"""

"\ndf.drop_duplicates(['event'], keep='first').shape # Default is keep=first\ndf.drop_duplicates(['event'], keep='last').shape #keep=last keeps the last instance and deletes the rest\ndf.drop_duplicates(['event'], keep=False).shape # this deletes all the occurances of the duplicates so none is left.\n"

## String Operations on whole columns

In [ ]:
df['event'].unique()

In [ ]:
# first parameter in str.replace is the one which we want to replace and the second one is with which we are replacing it
df['event'].str.replace('Sunny', 'Sunny Day').unique()
df

In [74]:
#df['event'] = df['event'].str.replace('Snow', 'Snow Day')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6    NaN
1  1/2/2017           35          7    NaN
2  1/3/2017           28          2    NaN
3  1/4/2017           24          7    NaN
4  1/5/2017           32          4    NaN
5  1/6/2017           31          2    NaN

In [156]:
df[df['event'].str.contains('Day')]
df

        day  temperature  windspeed  event New Artist
0  1/1/2017           32          6   Rain       Rain
1  1/2/2017           35          7  Sunny      Sunny
2  1/3/2017           28          2   Snow       Snow
3  1/4/2017           24          7   Snow       Snow
4  1/5/2017           32          4   Rain       Rain
5  1/6/2017           31          2  Sunny      Sunny

In [ ]:
df['InvestorsName'].str.contains('Khan').sum()
df

## Column Transformations / Splits

**1. Normal Conversion**

In [158]:
df.dtypes

day            object
temperature     int64
windspeed       int64
event          object
New Artist     object
dtype: object

In [162]:
df['temperature']=df['temperature'].astype(np.int32)
df.dtypes

day            object
temperature     int32
windspeed       int64
event          object
New Artist     object
dtype: object

___2. Dates Conversion___

In [170]:
df

        day  temperature  windspeed  event New Artist  month       Date
0  1/1/2017           32          6   Rain       Rain      1 2017-01-01
1  1/2/2017           35          7  Sunny      Sunny      2 2017-02-01
2  1/3/2017           28          2   Snow       Snow      3 2017-03-01
3  1/4/2017           24          7   Snow       Snow      4 2017-04-01
4  1/5/2017           32          4   Rain       Rain      5 2017-05-01
5  1/6/2017           31          2  Sunny      Sunny      6 2017-06-01

In [164]:
pd.to_datetime(df['day'])

0   2017-01-01
1   2017-01-02
2   2017-01-03
3   2017-01-04
4   2017-01-05
5   2017-01-06
Name: day, dtype: datetime64[ns]

In [171]:
df['Date'] = pd.to_datetime(df['day'].str.replace('/', '-'), dayfirst=True, errors='coerce')
df.dtypes

day                    object
temperature             int32
windspeed               int64
event                  object
New Artist             object
month                   int64
Date           datetime64[ns]
dtype: object

In [173]:
df['month'] = pd.DatetimeIndex(df['Date']).day
df

        day  temperature  windspeed  event New Artist  month       Date
0  1/1/2017           32          6   Rain       Rain      1 2017-01-01
1  1/2/2017           35          7  Sunny      Sunny      1 2017-02-01
2  1/3/2017           28          2   Snow       Snow      1 2017-03-01
3  1/4/2017           24          7   Snow       Snow      1 2017-04-01
4  1/5/2017           32          4   Rain       Rain      1 2017-05-01
5  1/6/2017           31          2  Sunny      Sunny      1 2017-06-01

**Extracting new columns from existing string columns**

In [ ]:
df['New Artist'].str.split(' ')
#df['InvestmentType'].str.split(' ').str[0]

## Missing Values

In [174]:
df.isnull().sum()

day            0
temperature    0
windspeed      0
event          0
New Artist     0
month          0
Date           0
dtype: int64

In [184]:
df
#df.replace(df['month'][1], 0)
#df['month'] = df['month'].fillna(0)
df

        day  temperature  windspeed  event New Artist  month       Date
0  1/1/2017           32          6   Rain       Rain      1 2017-01-01
1  1/2/2017           35          7  Sunny      Sunny      6 2017-02-01
2  1/3/2017           28          2   Snow       Snow      1 2017-03-01
3  1/4/2017           24          7   Snow       Snow      1 2017-04-01
4  1/5/2017           32          4   Rain       Rain      1 2017-05-01
5  1/6/2017           31          2  Sunny      Sunny      1 2017-06-01

In [140]:
df.fillna('0', inplace=True)              # Treating all Missing Values at once

## `DataFrame.loc` vs. `DataFrame.iloc` vs. `DataFrame.at`

One way to access unique elements is the 'iloc' method, where you can access the 1st row and first column as follows :

In [125]:
df.iloc[0]

day            1/1/2017
temperature          32
windspeed             6
event              Rain
Name: 0, dtype: object

In [126]:
df.iloc[[0]]

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain

In [127]:
df.iloc[0:2]              # access 1st 2 rows

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny

In [128]:
df.iloc[0:2,0:2]

        day  temperature
0  1/1/2017           32
1  1/2/2017           35

There is another method call 'loc' which uses names of row and column indexes.
Notice that 'iloc' was using row and column index to access values

In [129]:
df.loc[0:6,'event']

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [130]:
df.loc[0:2,'day':'event']

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

**Change Index**

In [131]:
df.set_index('day', inplace=True)
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [132]:
df.index

Index(['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'], dtype='object', name='day')

In [133]:
df.loc[['1/2/2017']]

          temperature  windspeed  event
day
1/2/2017           35          7  Sunny

In [134]:
df.reset_index(inplace=True)
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [135]:
df.set_index('event',inplace=True) # this is kind of building a hash map using event as a key
df

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Rain   1/5/2017           32          4
Sunny  1/6/2017           31          2

In [136]:
df.loc['Snow']

            day  temperature  windspeed
event
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7

## MultiIndexing

In [186]:
grouped = df.groupby(['event', 'day'])
grouped

In [188]:
new = grouped.agg({'temperature': {'Mean': np.mean, 'Sum':np.sum}})
new

/home/muhammadtaqi/anaconda3/lib/python3.6/site-packages/pandas/core/groupby/groupby.py:4658: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

               temperature
                      Mean Sum
event day
Rain  1/1/2017          32  32
      1/5/2017          32  32
Snow  1/3/2017          28  28
      1/4/2017          24  24
Sunny 1/2/2017          35  35
      1/6/2017          31  31

In [242]:
#new_new_df.dtypes
new_new_df.index

MultiIndex(levels=[['C1', 'C2', 'C3'], ['DUB', 'ISB', 'KHR', 'LAH', 'RWP']],
           labels=[[0, 0, 0, 1, 2, 2], [1, 3, 4, 2, 0, 4]],
           names=['Country', 'City'])

In [253]:
new_new_df.index.levels[1][new_new_df.index.labels[1]]

Index(['ISB', 'LAH', 'RWP', 'KHR', 'DUB', 'RWP'], dtype='object', name='City')

In [230]:
idx = pd.IndexSlice
new_new_df.loc[idx[:, ['ISB', 'RWP']], idx[:, 'Sum']]

             Sales
               Sum
Country City
C1      ISB     10
        RWP     55
C3      RWP     43

Empty DataFrame
Columns: []
Index: [(C1, ISB), (C1, LAH), (C1, RWP), (C2, KHR), (C3, DUB), (C3, RWP)]

In [231]:
df1 = pd.DataFrame( { 
    "Name" : ["Alice", "Ada", "Mallory", "Mallory", "Billy" , "Mallory"] , 
    "City" : ["Sydney", "Sydney", "Paris", "Sydney", "Sydney", "Paris"]} )

In [235]:
df1.groupby(["City"])[['Name']].count()

        Name
City
Paris      2
Sydney     4

## Column / Row Concatenation

In [252]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event', 'New Artist', 'month',
       'Date'],
      dtype='object')

## Looping through DataFrame

In [250]:
import time
start = time.time()
for x in df['day']:
    print(x)
end = time.time()
print(end - start)

1/1/2017
1/2/2017
1/3/2017
1/4/2017
1/5/2017
1/6/2017
0.0003914833068847656

Using iterrows func

In [251]:
start = time.time()

for index, row in df.iterrows():
    
    print(index,row['day'], row['event'])
end = time.time()
print(end - start)

0 1/1/2017 Rain
1 1/2/2017 Sunny
2 1/3/2017 Snow
3 1/4/2017 Snow
4 1/5/2017 Rain
5 1/6/2017 Sunny
0.002174854278564453

# Exercise

Import file **startup_funding.csv** and show following:

    1.) Top five rows
    2.) Last five rows
    3.) No. of rows and columns
    4.) Access 100th to 130th row with any 3 columns
    5.) Object types of each column
    6.) Null values count in each column
    7.) Summary Statistics